// 线性表的抽象数据类型
class list{
    constructor(){
       
    }
    // 数据结构
    dataType(){
        // 线性表的数据元素集合为{a1,a2,...,an},每个元素的数据结构均为dataType。
        // 其中，除第一个元素a1外，每一个元素有且只有一个直接前驱元素，
        // 除最后一个元素an外，每一个元素有且只有一个直接后继元素
        // 数据元素之间的关系是一对一的关系
    }
    // 算法
    init(){
        // 初始化操作，建立一个空的线性表
    }
    reset(){
        //将线性表清空
    }
    getLength(){
        //返回线性表的元素个数
    }
    isEmpty(){
        // 若线性表为空，返回true，否则返回false
    }
    insert(){
        //在线性表的第i个位置插入新元素
    }
    delete(){
        //删除线性表中第i个位置的元素并返回元素值
    }
    update(){
        //修改线性表中第i个位置的元素并返回原元素值
    }
    selectByKey(){
        //将线性表中第i个位置的元素值返回
    }
    selectByValue(){
        //在线性表中查找与给定值e相等的元素
        //查找成功，返回该元素在表中的位置
        //查找失败，返回0
    }
}